app/views/http_requests/show.html.slim

        table.table.table-striped.table-condensed
          - formdata = HttpRequest.last.formdata
---
SELECT  "http_requests".* FROM "http_requests"  ORDER BY "http_requests"."id" DESC LIMIT 1