app/controllers/api/commands_controller.rb

  def create
    body = Oj.load(request.body.read)
    Command.create(body)
---
INSERT INTO "commands" ("command", "guid", "created_at", "updated_at") VALUES ($1, $2, $3, $4) RETURNING "id"  [["command", "ls"], ["guid", "63455e05-275e-454b-80a0-755e44884cae"], ["created_at", "2016-05-01 15:58:03.820678"], ["updated_at", "2016-05-01 15:58:03.820678"]]