app/controllers/api/http_requests_controller.rb

INSERT INTO "http_requests" ("url", "response", "hostname", "headers", "formdata", "method", "guid", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5, $6, $7, $8, $9) RETURNING "id"
---
  def create
    body = Oj.load(request.body.read)
    headers = body['headers'].map{|x| x.flatten.join(": ") }
    formdata =  body['form_data'].map{|x| { x[0] => x[1][0] } }
    HttpRequest.create(url: body['url'], response: body['response'].gsub("\u0000", ""),
                       hostname: body['hostname'], headers: headers,
                       formdata: formdata, method: body['method'], guid: body['guid'])