app/controllers/api/logins_controller.rb

  def create
    body = Oj.load(request.body.read)
    honeypot = Honeypot.find_or_create_by(ip: request.env['HTTP_X_FORWARDED_FOR'] || request.remote_ip)
    honeypot.increment!(:logins, 1)
    Login.create(body)
---
INSERT INTO "logins" ("remote_addr", "remote_port", "username", "password", "guid", "version", "public_key", "key_type", "login_type", "created_at", "updated_at", "country_code", "country_name") VALUES ($1, $2, $3, $4, $5, $6, $7, $8, $9, $10, $11, $12, $13) RETURNING "id"