app/controllers/home_controller.rb

  def logins_by_day
    render json: Login.group_by_day(:created_at, range: 1.month.ago..Time.now, format: '%m/%d').count
---
SELECT COUNT(*) AS count_all, (DATE_TRUNC('day', (created_at::timestamptz - INTERVAL '0 second') AT TIME ZONE 'Etc/UTC') + INTERVAL '0 second') AT TIME ZONE 'Etc/UTC' AS day FROM "logins" WHERE (created_at >= '2016-04-01 19:57:41.297918' AND created_at <= '2016-05-01 19:57:41.298867') GROUP BY (DATE_TRUNC('day', (created_at::timestamptz - INTERVAL '0 second') AT TIME ZONE 'Etc/UTC') + INTERVAL '0 second') AT TIME ZONE 'Etc/UTC'

  def logins_by_country
    render json: Login.group(:country_name).where(created_at:  1.month.ago..Time.now).count
---
SELECT "logins".* FROM "logins" WHERE ("logins"."created_at" BETWEEN '2016-04-01 23:23:31.840455' AND '2016-05-01 23:23:31.840549') GROUP BY "logins"."country_name"
SELECT COUNT(*) AS count_all, (DATE_TRUNC('day', (created_at::timestamptz - INTERVAL '0 second') AT TIME ZONE 'Etc/UTC') + INTERVAL '0 second') AT TIME ZONE 'Etc/UTC' AS day FROM "logins" WHERE (created_at >= '2016-04-01 23:22:20.426671' AND created_at <= '2016-05-01 23:22:20.426756') GROUP BY (DATE_TRUNC('day', (created_at::timestamptz - INTERVAL '0 second') AT TIME ZONE 'Etc/UTC') + INTERVAL '0 second') AT TIME ZONE 'Etc/UTC'