app/controllers/http_requests_controller.rb

SELECT  "http_requests".* FROM "http_requests"  ORDER BY "http_requests"."id" DESC LIMIT 25 OFFSET 0
SELECT COUNT(*) FROM "http_requests"
---
  def index
    @requests = HttpRequest.order(id: :desc)
    @requests = @requests.page(params[:page])

SELECT  "http_requests".* FROM "http_requests" WHERE "http_requests"."id" = $1 LIMIT 1  [["id", 77]]
---
  def show
    @request = HttpRequest.find(params[:id])