app/controllers/logins_controller.rb

SELECT "logins".* FROM "logins"  ORDER BY "logins"."id" DESC
SELECT "logins".* FROM "logins" WHERE "logins"."remote_addr" = $1  ORDER BY "logins"."id" DESC  [["remote_addr", "136.243.55.198"]]
SELECT "logins".* FROM "logins" WHERE "logins"."username" = $1  ORDER BY "logins"."id" DESC  [["username", "root"]]
SELECT "logins".* FROM "logins" WHERE "logins"."version" = $1  ORDER BY "logins"."id" DESC  [["version", "SSH-2.0-PUTTY"]]
SELECT  "logins".* FROM "logins" WHERE "logins"."remote_addr" = $1  ORDER BY "logins"."id" DESC LIMIT 25 OFFSET 0  [["remote_addr", "61.184.115.195"]]
SELECT COUNT(*) FROM "logins" WHERE "logins"."remote_addr" = $1  [["remote_addr", "61.184.115.195"]]
---
  def index
    @logins = Login.order(id: :desc)
    @logins = @logins.where(remote_addr: params[:ip]) if params[:ip].present?
    @logins = @logins.where(username: params[:username]) if params[:username].present?
    @logins = @logins.where(version: params[:client]) if params[:client].present?
    @logins = @logins.page(params[:page])